In [21]:
import numpy as np
import pandas as pd

In [22]:
labels = ['a','b','c']
my_data =(10,20,30)
arr = np.array(my_data)

In [23]:
arr

array([10, 20, 30])

In [24]:
d ={'a':10,'b':20,'c':30}

In [25]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [26]:
d

{'a': 10, 'b': 20, 'c': 30}

In [27]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [28]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [29]:
ser1= pd.Series([1,2,3,5],['USA','Germany','Italy','Japan'])

In [30]:
ser1

USA        1
Germany    2
Italy      3
Japan      5
dtype: int64

In [31]:
ser3 = pd.Series(data=labels)

In [32]:
ser3 + ser1

0          NaN
1          NaN
2          NaN
Germany    NaN
Italy      NaN
Japan      NaN
USA        NaN
dtype: object

In [33]:
ser1 + ser3 +ser1

0          NaN
1          NaN
2          NaN
Germany    NaN
Italy      NaN
Japan      NaN
USA        NaN
dtype: object

# Gets same random numbers everytime

In [260]:
from numpy.random import randn

In [261]:
np.random.seed(101)

In [262]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['L','M','N','O'])

In [263]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [264]:
pd.Series(data=[1],index=['a'])

a    1
dtype: int64

In [265]:
df[['L','M']]

          L         M
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [266]:
df['L']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: L, dtype: float64

In [267]:
df['new_col'] = df['L']+df['M']

In [268]:
df['new_col']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
Name: new_col, dtype: float64

In [269]:
df

          L         M         N         O   new_col
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [270]:
df.drop('new_col', axis = 1)

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [271]:
df

          L         M         N         O   new_col
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [272]:
df.drop('new_col', axis = 1, inplace = True)

In [273]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [274]:
df.drop('E', inplace = True)

In [275]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [276]:
df.shape

(4, 4)

In [277]:
#rows

In [278]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [279]:
df.loc['A'] 
#takes row name

L    2.706850
M    0.628133
N    0.907969
O    0.503826
Name: A, dtype: float64

In [280]:
df.iloc[1]
#takes index

L    0.651118
M   -0.319318
N   -0.848077
O    0.605965
Name: B, dtype: float64

In [281]:
df.loc['B','O']

0.6059653494949336

In [282]:
df.loc[['A','C'],['N','O']]

          N         O
A  0.907969  0.503826
C  0.528813 -0.589001

In [283]:
df.iloc[[1,0],[0,3]]

          L         O
B  0.651118  0.605965
A  2.706850  0.503826

In [284]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [285]:
bool_df = df > 1

In [286]:
bool_df

       L      M      N      O
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False

In [287]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [288]:
df['P'] = df['L'] + df['N']

In [289]:
df

          L         M         N         O         P
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [290]:
df.loc['E'] = df.loc['A'] * df.loc['B']

In [291]:
df

          L         M         N         O         P
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  1.762479 -0.200574 -0.770028  0.305301 -0.711971

In [292]:
df.drop('P',axis=1,inplace = True)

In [293]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [294]:
df['L'] > 0

A     True
B     True
C    False
D     True
E     True
Name: L, dtype: bool

In [295]:
df[df['O']<0]

          L         M         N         O
C -2.018168  0.740122  0.528813 -0.589001

In [296]:
df.loc['E'] > 0 #for row

L     True
M    False
N    False
O     True
Name: E, dtype: bool

In [297]:
df[df['L']>0]

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [298]:
result = df[df['L']>0]

In [299]:
result

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [300]:
result.loc['A']

L    2.706850
M    0.628133
N    0.907969
O    0.503826
Name: A, dtype: float64

In [301]:
result['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [302]:
df[df['L']>0]['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [303]:
df[df['L']>0]['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [304]:
df[df['L']>0]['O']

A    0.503826
B    0.605965
D    0.955057
E    0.305301
Name: O, dtype: float64

In [305]:
df[df['L']>0]

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [306]:
df[df['L']>0][['M','N']]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [307]:
df['L']>0

A     True
B     True
C    False
D     True
E     True
Name: L, dtype: bool

In [308]:
result = df['L']>0

In [309]:
result

A     True
B     True
C    False
D     True
E     True
Name: L, dtype: bool

In [310]:
val = df[result]

In [311]:
val

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [312]:
col = ['M','N']

In [313]:
val[col]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [314]:
val[['M','N']]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [315]:
#the above code can be written in a single line
df[df['L']>0][['M','N']]

          M         N
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E -0.200574 -0.770028

In [316]:
df[(df['L'] > 0) & (df['N'] < 0)]

          L         M         N         O
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [317]:
df[(df['L'] > 0) | (df['N'] < 0)]

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [318]:
(df['L'] > 0) & (df['N'] < 0)

A    False
B     True
C    False
D     True
E     True
dtype: bool

In [319]:
(df['L'] > 0) | (df['N'] < 0)

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [320]:
df.reset_index()

  index         L         M         N         O
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  1.762479 -0.200574 -0.770028  0.305301

In [321]:
df

          L         M         N         O
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  1.762479 -0.200574 -0.770028  0.305301

In [322]:
df.reset_index(inplace = True)

In [323]:
df

  index         L         M         N         O
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  1.762479 -0.200574 -0.770028  0.305301

In [324]:
df['index']

0    A
1    B
2    C
3    D
4    E
Name: index, dtype: object

In [325]:
newwind = 'CA NY WY OR CO'.split(" ")

In [326]:
newwind

['CA', 'NY', 'WY', 'OR', 'CO']

In [327]:
df['States']=newwind

In [328]:
df

  index         L         M         N         O States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  1.762479 -0.200574 -0.770028  0.305301     CO

In [329]:
df['States']

0    CA
1    NY
2    WY
3    OR
4    CO
Name: States, dtype: object

In [330]:
df.set_index(['L'])

          index         M         N         O States
L
 2.706850     A  0.628133  0.907969  0.503826     CA
 0.651118     B -0.319318 -0.848077  0.605965     NY
-2.018168     C  0.740122  0.528813 -0.589001     WY
 0.188695     D -0.758872 -0.933237  0.955057     OR
 1.762479     E -0.200574 -0.770028  0.305301     CO

In [331]:
df.set_index(['States'])

       index         L         M         N         O
States
CA         A  2.706850  0.628133  0.907969  0.503826
NY         B  0.651118 -0.319318 -0.848077  0.605965
WY         C -2.018168  0.740122  0.528813 -0.589001
OR         D  0.188695 -0.758872 -0.933237  0.955057
CO         E  1.762479 -0.200574 -0.770028  0.305301

In [381]:
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]

In [382]:
higher_index =list(zip(outside,inside))
higher_index= pd.MultiIndex.from_tuples(higher_index)

In [383]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [384]:
inside

[1, 2, 3, 1, 2, 3]

In [385]:
higher_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [386]:
df = pd.DataFrame(np.random.rand(6,2),higher_index,['A','B'])

In [387]:
df

             A         B
G1 1  0.659925  0.529623
   2  0.748520  0.093757
   3  0.784522  0.687242
G2 1  0.695078  0.496867
   2  0.975361  0.203528
   3  0.299020  0.227656

In [388]:
df.loc['G1']

          A         B
1  0.659925  0.529623
2  0.748520  0.093757
3  0.784522  0.687242

In [389]:
df.loc['G1']['A']

1    0.659925
2    0.748520
3    0.784522
Name: A, dtype: float64

In [390]:
df.loc['G2'].iloc[1]

A    0.975361
B    0.203528
Name: 2, dtype: float64

In [391]:
df.index.names = ['Groups','Num']

In [395]:
df

                   A         B
Groups Num
G1     1    0.659925  0.529623
       2    0.748520  0.093757
       3    0.784522  0.687242
G2     1    0.695078  0.496867
       2    0.975361  0.203528
       3    0.299020  0.227656

In [400]:
df.loc['G2'].loc[2]['B']

0.20352762060152108

In [405]:
df.loc['G1'].loc[1]

A    0.659925
B    0.529623
Name: 1, dtype: float64

In [406]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.659925  0.529623
G2      0.695078  0.496867

In [407]:
df={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [413]:
df=pd.DataFrame(df)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [410]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [412]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [414]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [415]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [416]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [419]:
df.fillna(1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [421]:
df.fillna(df['A'].max())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3